# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [2,4, 6,4, 10,12]  #4
  - [14,18, 22,14, 18,28]  # P4/16

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   #320*320*32
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   #160*160*64
   [-1, 3, C3, [128]],  #2
   #160*160*64
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  #3 10-P1/2
   [-1, 1, Conv, [128, 3, 2]],  
   [-1, 3, C3, [128]],
   #160*160*64
   [[-1, 2], 1, Concat2, [1]],  #6
   #160*160*128
   [-1, 1, Conv, [128, 3, 1]], 
   [-1, 3, C3, [128]],
   #160*160*64
   [-1, 1, Conv, [256, 3, 2]], 
   #80*80*128
   [-1, 9, C3, [256]], #10
   #80*80*128
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [128, 1, 1]], # 80*80*64
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #160*160*64
   [[-1, 8], 1, Concat, [1]],  # cat backbone P3 160*160*128
   [-1, 1, C3, [128, False]],  # 14 (P3/8-small)  160*160*64
   
   [-1, 1, Conv, [128, 3, 2]],  #80*80*64
   [[-1, 11], 1, Concat, [1]],  # cat head P4 80*80*128
   [-1, 1, C3, [256, False]],  # 17 (P4/16-medium) 80*80*128

   
   [[14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
