# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [3,6, 8,14, 18,26]  #4

backbone1:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   #320*320*32
   [-1, 3, C3, [64]],  #1
   #320*320*32
  ]

backbone2:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  #3 10-P1/2
   [-1, 3, C3, [64]],  #1
   #320*320*32
   [[-1, 1], 1, Concat2, [1]],  #4
   #320*320*64
   [-1, 1, Conv, [64, 3, 1]],  
   #320*320*32
   [-1, 1, Conv, [128, 3, 2]], 
   [-1, 3, C3, [128]],
   #160*160*64
   #160*160*128
   [-1, 1, Conv, [128, 3, 1]], 
   [-1, 3, C3, [128]],
   #160*160*64
   [-1, 1, Conv, [256, 3, 2]], 
   #80*80*128
   [-1, 9, C3, [256]], #11
   #80*80*128
   [-1, 1, Conv, [512, 3, 2]], 
   #40*40*256
   [-1, 9, C3, [512]], #
   #40*40*256
   [-1, 1, SPPF, [512, 5]],  # 14
   #40*40*256
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [256, 1, 1]], # 40*40*128
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #80*80*128
   [[-1, 11], 1, Concat, [1]],  # cat backbone P3 80*80*256
   [-1, 1, C3, [256, False]],  # 18 (P3/8-small)  80*80*128
   
   [-1, 1, Conv, [128, 1, 1]], # 80*80*64
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #160*160*64
   [[-1, 9], 1, Concat, [1]],  # cat backbone P3 160*160*128
   [-1, 1, C3, [128, False]],  # 22 (P3/8-small)  160*160*64
   

   [[22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
